k-nowicki/esp32_weather_logger/components/esp32-camera/sensors/nt99141.c
    sensor->status.framesize = framesize;
    ret = write_regs(sensor->slv_addr, sensor_default_regs);

    if (framesize == FRAMESIZE_QVGA) {
        ESP_LOGD(TAG, "Set FRAMESIZE_QVGA");
        ret = write_regs(sensor->slv_addr, sensor_framesize_QVGA);
#if    CONFIG_NT99141_SUPPORT_XSKIP
        ESP_LOGD(TAG, "Set FRAMESIZE_QVGA: xskip mode");
        ret = write_regs(sensor->slv_addr, sensor_framesize_QVGA_xskip);
#elif  CONFIG_NT99141_SUPPORT_CROP
        ESP_LOGD(TAG, "Set FRAMESIZE_QVGA: crop mode");
        ret = write_regs(sensor->slv_addr, sensor_framesize_QVGA_crop);
#endif
    } else if (framesize == FRAMESIZE_VGA) {
        ESP_LOGD(TAG, "Set FRAMESIZE_VGA");
        // ret = write_regs(sensor->slv_addr, sensor_framesize_VGA);
        ret = write_regs(sensor->slv_addr, sensor_framesize_VGA_xyskip);// Resolution:640*360 This configuration is equally-scaled without deforming
#ifdef CONFIG_NT99141_SUPPORT_XSKIP
        ESP_LOGD(TAG, "Set FRAMESIZE_QVGA: xskip mode");
        ret = write_regs(sensor->slv_addr, sensor_framesize_VGA_xskip);
#elif CONFIG_NT99141_SUPPORT_CROP
        ESP_LOGD(TAG, "Set FRAMESIZE_QVGA: crop mode");
        ret = write_regs(sensor->slv_addr, sensor_framesize_VGA_crop);
#endif
    } else if (framesize >= FRAMESIZE_HD) {
        ESP_LOGD(TAG, "Set FRAMESIZE_HD");
        ret = write_regs(sensor->slv_addr, sensor_framesize_HD);
    } else {
        ESP_LOGD(TAG, "Dont suppost this size, Set FRAMESIZE_VGA");
        ret = write_regs(sensor->slv_addr, sensor_framesize_VGA);
    }

    return ret;
}

static int set_hmirror(cam_sensor_t *sensor, int enable)
{
    int ret = 0;
    sensor->status.hmirror = enable;
    ret = set_image_options(sensor);

    if (ret == 0) {
        ESP_LOGD(TAG, "Set h-mirror to: %d", enable);
    }

    return ret;
}

static int set_vflip(cam_sensor_t *sensor, int enable)
{
    int ret = 0;
    sensor->status.vflip = enable;
    ret = set_image_options(sensor);

    if (ret == 0) {
        ESP_LOGD(TAG, "Set v-flip to: %d", enable);
    }

    return ret;
}

static int set_quality(cam_sensor_t *sensor, int qs)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, COMPRESSION_CTRL07, qs & 0x3f);

    if (ret == 0) {
        sensor->status.quality = qs;
        ESP_LOGD(TAG, "Set quality to: %d", qs);
    }

    return ret;
}

static int set_colorbar(cam_sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, PRE_ISP_TEST_SETTING_1, TEST_COLOR_BAR, enable);

    if (ret == 0) {
        sensor->status.colorbar = enable;
        ESP_LOGD(TAG, "Set colorbar to: %d", enable);
    }

    return ret;
}

static int set_gain_ctrl(cam_sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg_bits(sensor->slv_addr, 0x32bb, 0x87, enable);

    if (ret == 0) {
        ESP_LOGD(TAG, "Set gain_ctrl to: %d", enable);
        sensor->status.agc = enable;
    }

    return ret;
}

static int set_exposure_ctrl(cam_sensor_t *sensor, int enable)
{
    int ret = 0;
       int data = 0;
    // ret = write_reg_bits(sensor->slv_addr, 0x32bb, 0x87, enable);
    data = read_reg(sensor->slv_addr, 0x3201);
    ESP_LOGD(TAG, "set_exposure_ctrl:enable");
    if (enable) {
        ESP_LOGD(TAG, "set_exposure_ctrl:enable");
        ret = write_reg(sensor->slv_addr, 0x3201, (1 << 5) | data);
    } else {
        ESP_LOGD(TAG, "set_exposure_ctrl:disable");
        ret = write_reg(sensor->slv_addr, 0x3201, (~(1 << 5)) & data);
    }

    if (ret == 0) {
        ESP_LOGD(TAG, "Set exposure_ctrl to: %d", enable);
        sensor->status.aec = enable;
    }

    return ret;
}

static int set_whitebal(cam_sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set awb to: %d", enable);
        sensor->status.awb = enable;
    }

    return ret;
}

//Advanced AWB
static int set_dcw_dsp(cam_sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set dcw to: %d", enable);
        sensor->status.dcw = enable;
    }

    return ret;
}

//night mode enable
static int set_aec2(cam_sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set aec2 to: %d", enable);
        sensor->status.aec2 = enable;
    }

    return ret;
}

static int set_bpc_dsp(cam_sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set bpc to: %d", enable);
        sensor->status.bpc = enable;
    }

    return ret;
}

static int set_wpc_dsp(cam_sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set wpc to: %d", enable);
        sensor->status.wpc = enable;
    }

    return ret;
}

//Gamma enable
static int set_raw_gma_dsp(cam_sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set raw_gma to: %d", enable);
        sensor->status.raw_gma = enable;
    }

    return ret;
}

static int set_lenc_dsp(cam_sensor_t *sensor, int enable)
{
    int ret = 0;

    if (ret == 0) {
        ESP_LOGD(TAG, "Set lenc to: %d", enable);
        sensor->status.lenc = enable;
    }

    return ret;
}

static int get_agc_gain(cam_sensor_t *sensor)
{
    ESP_LOGD(TAG, "get_agc_gain can not be configured at present");
    return 0;
}

//real gain
static int set_agc_gain(cam_sensor_t *sensor, int gain)
{
    ESP_LOGD(TAG, "set_agc_gain can not be configured at present");
    // ESP_LOGD(TAG, "GAIN = %d\n", gain);
    int cnt = gain / 2;

    switch (cnt) {
        case 0:
            ESP_LOGD(TAG, "set_agc_gain: 1x");
            write_reg(sensor->slv_addr, 0X301D, 0X00);
            break;

        case 1:
            ESP_LOGD(TAG,"set_agc_gain: 2x");
            write_reg(sensor->slv_addr, 0X301D, 0X0F);
            break;

        case 2:
            ESP_LOGD(TAG,"set_agc_gain: 4x");
            write_reg(sensor->slv_addr, 0X301D, 0X2F);
            break;

        case 3:
            ESP_LOGD(TAG,"set_agc_gain: 6x");
            write_reg(sensor->slv_addr, 0X301D, 0X37);
            break;

        case 4:
            ESP_LOGD(TAG,"set_agc_gain: 8x");
            write_reg(sensor->slv_addr, 0X301D, 0X3F);
            break;

        default:
            ESP_LOGD(TAG,"fail set_agc_gain");
            break;
    }

