k-nowicki/esp32_weather_logger/components/esp32-camera/sensors/nt99141.c
    return 0;
}

static int get_aec_value(cam_sensor_t *sensor)
{
    ESP_LOGD(TAG, "get_aec_value can not be configured at present");
    return 0;
}

static int set_aec_value(cam_sensor_t *sensor, int value)
{
    ESP_LOGD(TAG, "set_aec_value can not be configured at present");
    int ret = 0;
    // ESP_LOGD(TAG, " set_aec_value to: %d", value);
    ret = write_reg_bits(sensor->slv_addr, 0x3012, 0x00, (value >> 8) & 0xff);
    ret = write_reg_bits(sensor->slv_addr, 0x3013, 0x01, value & 0xff);

    if (ret == 0) {
        ESP_LOGD(TAG, " set_aec_value to: %d", value);
        // sensor->status.aec = enable;
    }

    return ret;
}

static int set_ae_level(cam_sensor_t *sensor, int level)
{
    ESP_LOGD(TAG, "set_ae_level can not be configured at present");
    int ret = 0;

    if (level < 0) {
        level = 0;
    } else if (level > 9) {
        level = 9;
    }

    for (int i = 0; i < 5; i++) {
        ret += write_reg(sensor->slv_addr, sensor_ae_level[ 5 * level + i ][0], sensor_ae_level[5 * level + i ][1]);
    }

    if (ret) {
        ESP_LOGE(TAG, " fail to set ae level: %d", ret);
    }

    return 0;
}

static int set_wb_mode(cam_sensor_t *sensor, int mode)
{
    int ret = 0;

    if (mode < 0 || mode > 4) {
        return -1;
    }

    ret = write_reg(sensor->slv_addr, 0x3201, (mode != 0));

    if (ret) {
        return ret;
    }

    switch (mode) {
        case 1://Sunny
            ret  = write_reg16(sensor->slv_addr, 0x3290, 0x01)
                   || write_reg16(sensor->slv_addr, 0x3291, 0x38)
                   || write_reg16(sensor->slv_addr, 0x3296, 0x01)
                   || write_reg16(sensor->slv_addr, 0x3297, 0x68)
                   || write_reg16(sensor->slv_addr, 0x3060, 0x01);

            break;

        case 2://Cloudy

            ret  = write_reg16(sensor->slv_addr, 0x3290, 0x01)
                   || write_reg16(sensor->slv_addr, 0x3291, 0x51)
                   || write_reg16(sensor->slv_addr, 0x3296, 0x01)
                   || write_reg16(sensor->slv_addr, 0x3297, 0x00)
                   || write_reg16(sensor->slv_addr, 0x3060, 0x01);
            break;

        case 3://INCANDESCENCE]
            ret  = write_reg16(sensor->slv_addr, 0x3290, 0x01)
                   || write_reg16(sensor->slv_addr, 0x3291, 0x30)
                   || write_reg16(sensor->slv_addr, 0x3296, 0x01)
                   || write_reg16(sensor->slv_addr, 0x3297, 0xCB)
                   || write_reg16(sensor->slv_addr, 0x3060, 0x01);
            break;

        case 4://FLUORESCENT
            ret  = write_reg16(sensor->slv_addr, 0x3290, 0x01)
                   || write_reg16(sensor->slv_addr, 0x3291, 0x70)
                   || write_reg16(sensor->slv_addr, 0x3296, 0x01)
                   || write_reg16(sensor->slv_addr, 0x3297, 0xFF)
                   || write_reg16(sensor->slv_addr, 0x3060, 0x01);
            break;

        default://AUTO
            break;
    }

    if (ret == 0) {
        ESP_LOGD(TAG, "Set wb_mode to: %d", mode);
        sensor->status.wb_mode = mode;
    }

    return ret;
}

static int set_awb_gain_dsp(cam_sensor_t *sensor, int enable)
{
    int ret = 0;
    int old_mode = sensor->status.wb_mode;
    int mode = enable ? old_mode : 0;

    ret = set_wb_mode(sensor, mode);

    if (ret == 0) {
        sensor->status.wb_mode = old_mode;
        ESP_LOGD(TAG, "Set awb_gain to: %d", enable);
        sensor->status.awb_gain = enable;
    }

    return ret;
}

static int set_special_effect(cam_sensor_t *sensor, int effect)
{
    int ret = 0;

    if (effect < 0 || effect > 6) {
        return -1;
    }

    uint8_t *regs = (uint8_t *)sensor_special_effects[effect];
    ret =  write_reg(sensor->slv_addr, 0x32F1, regs[0])
           || write_reg(sensor->slv_addr, 0x32F4, regs[1])
           || write_reg(sensor->slv_addr, 0x32F5, regs[2])
           || write_reg(sensor->slv_addr, 0x3060, regs[3]);

    if (ret == 0) {
        ESP_LOGD(TAG, "Set special_effect to: %d", effect);
        sensor->status.special_effect = effect;
    }

    return ret;
}

static int set_brightness(cam_sensor_t *sensor, int level)
{
    int ret = 0;
    uint8_t value = 0;

    switch (level) {
        case 3:
            value = 0xA0;
            break;

        case 2:
            value = 0x90;
            break;

        case 1:
            value = 0x88;
            break;

        case -1:
            value = 0x78;
            break;

        case -2:
            value = 0x70;
            break;

        case -3:
            value = 0x60;
            break;

        default: // 0
            break;
    }

    ret = write_reg(sensor->slv_addr, 0x32F2, value);

    if (ret == 0) {
        ESP_LOGD(TAG, "Set brightness to: %d", level);
        sensor->status.brightness = level;
    }

    return ret;
}

static int set_contrast(cam_sensor_t *sensor, int level)
{
    int ret = 0;
    uint8_t value1 = 0, value2 = 0 ;

    switch (level) {
        case 3:
            value1 = 0xD0;
            value2 = 0xB0;
            break;

        case 2:
            value1 = 0xE0;
            value2 = 0xA0;
            break;

        case 1:
            value1 = 0xF0;
            value2 = 0x90;
            break;

        case 0:
            value1 = 0x00;
            value2 = 0x80;
            break;

        case -1:
            value1 = 0x10;
            value2 = 0x70;
            break;

        case -2:
            value1 = 0x20;
            value2 = 0x60;
            break;

        case -3:
            value1 = 0x30;
            value2 = 0x50;
            break;

        default: // 0
            break;
    }

    ret = write_reg(sensor->slv_addr, 0x32FC, value1);
    ret = write_reg(sensor->slv_addr, 0x32F2, value2);
    ret = write_reg(sensor->slv_addr, 0x3060, 0x01);

    if (ret == 0) {
        ESP_LOGD(TAG, "Set contrast to: %d", level);
        sensor->status.contrast = level;
    }

    return ret;
}

static int set_saturation(cam_sensor_t *sensor, int level)
{
    int ret = 0;

